import 'package:flutter/material.dart';

class Data {
  static List shayariname = [
    "प्रेरणा स्त्रोत शायरी",
    "जीवन शायरी",
    "मोहब्बत शायरी",
    "यादें शायरी",
    "अन्य शायरी",
    "राजनीती शायरी",
    "प्रेम शायरी",
    "दर्द शायरी"
  ];
  static List shayariimage = [
    "image/Logo/1_23.webp",
    "image/Logo/life-status-shayari-20996.webp",
    "image/Logo/Pyar-Mohabbat-Shayariya-Hindi-Mein-1.webp",
    "image/Logo/yaad-shayari-in-hindi.jpg",
    "image/Logo/638316715sst1645300278.webp",
    "image/Logo/Political-shayari74.jpg",
    "image/Logo/Best-Prem-Shayari-1-1.webp",
    "image/Logo/WhatsApp Image 2020-04-07 at 14.51.11 (2).jpeg"
  ];
  static List motivationalshayari = [
    """अच्छी 🤔 बातें करने वाला हर 🤗 
    इंसान अच्छा 😩 नही होता !!
    लेकिन 🤔 अच्छी नियत 💓 और अच्छी सोच रखने 😎 वाले
    हर इंसान 🤗 अच्छा होता है !!
  """,
    """जब तक 🤔 जिंदा है 
    तबतक बात 🤗 कर लिया 🌞 करो !!
    जब मर 😢  जायेंगे तो हम 😖 
    खुद ही शिकायत का 😯 मौका नही देंगे !!
  """,
    """कोई 🤔 ज़रूरी नही 😯 की पति 👫
     पत्नी के विचार 💕 मिलते हो !!
     ज़रूरी 🤔 यह है कि दोनों 👫 को बेमेल 
    विचारो 💕 के साथ रहना 🤗 आता हो !!""",
    """जीवन 🤔 मे कई बार हमारे 🤗 काम को लेकर लोग 😖 सवाल करते है !!
उन्हें 🤔 जवाब देते समय 🕑 गुस्सा ना करे !!
सोच 🤔 समझकर शांति के 😖 साथ ऐसे शब्दों का 💓 उपयोग करे !!
जिनसे 😯 सुनने वाले व्यक्ति के🤗  चेहरे पर मुस्कान आ 💋 जाए और उसको 💕 हमारा उत्तर भी मिल 😎 जाये !!""",
    """यदि 🤔 लक्ष्य ना मिले तो 👁️ 
    रास्ते बदलो लक्ष्य 🌃 नही !!
    क्योंकि 🤔 वृक्ष अपनी पत्तियां 🌞 
    बदलती है जड़ 🤔 नही !!""",
    """उनके 🤔 सामने हमेशा खुश 🤗 रहो !!
जो 👲🏻 आपको पसंद 😩 नही करते !!
क्योंकि 🤗 आपकी खुशी उन्हें चैन 😩 से जीने नही 😢 देगी !!""",
    """प्रार्थना 🤔 ऐसे करो जैसे 🤗 सबकुछ भगवान 🌞 पर निर्भर करता 💕 है !!
और 🤔 पर्यास ऐसे करो 🤗 जैसे सबकुछ आप 👲🏻 पर निर्भर 💕 करता है !!""",
    """अपनी 🤔 जिद को पूरा 😯 करने के लिए इंसान 👫 ना जाने क्या से क्या 🤗 कर जाता है !!
वह 🤔 ना चाहकर भी 👫 अपनो को काफी कष्ट 😩 दे जाता है !!"""
  ];
  static List lifeshayari = [
    """दूसरे 🙂 के #दोष 😈 पर ध्यान देते #समय 🕦
हम 😎 #स्वयं बहुत #भले 👼 बन जाते हैं।
परंतु जब हम 😔 #अपने दोषों पर 🤓 #ध्यान देंगे।
तो अपने आपको #कुटिल 😡 और #कामी 😵 पाएँगे।""",
    """जन्म-जन्मांतर 🙅‍♂️ के #टूटे 💔
#रिश्ते 👫 भी #जुड़ 👨‍👨‍👦‍👦 जाते हैं, 
बस सामने 👦 वाले को #आपसे 🤷‍♂️
कोई #काम 🔖 पड़ना चाहिए।""",
    """समझदार 🙇 #व्यक्ति खुद #गलतियां 😡नहीं करता है,
बल्कि 😎 दुसरों की #गलतियों 🧛 से जीवन की 
#सच्चाई 🙋‍♂️ परख लिया करता है""",
    """जब #इंसान 🤷‍♂️ के #जीवन 🙆‍♂️ में हालात #बिगड़ 😡 जाते हैं,
तो कुछ #लोग 👼 बहुत #टूट 💔 जाते हैं,
और कुछ लोग 🥇 #रिकॉर्ड #तोड़ते 💥 हैं""",
    """अपनी जिंदगी💫 में हर किसी को अहमियत🙏 दीजिये क्योंकि, 
    जो अच्छे😇 होंगे वो साथ🤝 देंगे और जो बुरे😈 होंगे वो सबक़ देंगे💪""",
    """जीवन एक सफर हैं, 🛤️
हर रोज़ नयी राहों पर चलते जाएं। 🚶‍♂️
हंसते रहें दिल से, 😊
किसी से दूर ना रहते जाएं। 🤗""",
    """कभी चुप रहें, 🤐
कभी बोलें ख़ुशियों की बातें। 😄
हार न मानें, ✊
हर अवसर पे जीत की चाहतें। 🏆""",
    """धैर्य रखें हमेशा, 🙏
बदलते समयों के साथ चलें। ⏳
संघर्षों से नहीं डरें, 😤
खुद को और मजबूत बनाएँ। 💪"""
  ];
  static List mohabbatshayari = [
    """दिल 💓 का दरिया बहता हैं,
मोहब्बत 💞 का समंदर उबलता हैं।
आँखों 👀 से दरिया बह ना पाया,
दिल 💔 के सहारे मोहब्बत खिल जाती हैं।""",
    """दिल 💓 के क़रीब रहें, 👨‍❤️‍👨
मोहब्बत 💞 का नज़रिया समझें।
ज़िंदगी 🌈 के हर पल को मोहब्बत 💕 से जींदें,
दर्द 😢 भी आने वाले पलों में मोहब्बत 💖 से छिपें।""",
    """मोहब्बत 💞 के खेल में हैं राजा और रानी,
दिल 💓 के ख़्वाबों में बसे हैं दीवाने।
दिल 💔 को छूने वाली हर बात मोहब्बत 💘 की हैं,
जीवन 🌟 को रंगीन और मधुर बनाती हैं मोहब्बत 💗 की ख़ातिर।""",
    """दिल 💓 में छुपी उम्मीदों की चिंगारी,
मोहब्बत 💞 का आग बनकर जलती हैं।
दिल 💔 के साथ ज़िन्दगी को जीना हैं,
मोहब्बत 💕 की गर्मी में जलती रहती हैं।""",
    """मोहब्बत 💞 की बारिश में भीगी हुई रातें,
दिल 💓 की आवाज़ में गुनगुनाती हैं।
जब मोहब्बत 💘 का सफर शुरू होता हैं,
दिल 💔 में ख़ुशियाँ बहती रहती हैं।""",
    """मोहब्बत 💞 के लिए दिल 💓 बेकरार होता हैं,
जब दो आँखें 👀 बातें बयां करती हैं।
दिल 💔 को मोहब्बत 💖 से जोड़ने वाली हैं ये आँखें 👀,
मोहब्बत 💕 की बारिश में ख़ुद को भिगोती हैं।""",
    """दिल 💔 के क़रीब ❤️ थे हम,
मोहब्बत के 🔥 दीवाने 😍 थे हम।
प्यार की 🌹 मोहब्बत 🌙 से हो गई,
हम एक 💑 दूजे के बिना 😢 रह गए।""",
    """दिल 💔 की आग 🔥 जब मोहब्बत 💘 में जलती हैं,
फिर से उस अदा 💫 पर मर मिटें हम। 😢
मोहब्बत का चांद 🌙 जब उभरता हैं,
दिल ❤️ की बातें 🌹 सबको भूला देता हैं।"""
  ];
  static List yaadshayari = [
    """यादों 💭 की बारिश 🌧️ में, 
    अक्सर हम 📸 भीग जाते हैं,
वो चेहरा 🌸 जो हमेशा हमारे सपनों में आते हैं।""",
    """जब भी तुम्हारी याद 💌 आती हैं,
     दिल 🌹 खो जाता हैं,
मुझे तेरी गलियों की हवा 🌬️ भी रुला जाती हैं।""",
    """ये रातें 🌙 भरी हुई हैं तेरी यादों से,
बिना तेरी ज़िन्दगी 🌼 बेवजह सी लगती हैं।""",
    """यादें 💭 मेरी तेरे आगे झुक जाती हैं,
मोहब्बत की धड़कन 🎵 बेख़ौफ़ हो जाती हैं।""",
    """तेरी यादों 💌 का साया 😔 मेरे दिल पर छाया हुआ हैं,
जब भी तुझे याद करता हूँ, खुद को मैं खो जाता हूँ।""",
    """यादों 🌸 के फूल 💭 में भरी हैं मेरी सोचें,
दिल ❤️ के क़ाफिले 🌼 यादों में खो जाते हैं।
जब तक तेरी 💔 याद 🌙 मेरे साथ होती हैं,
जीने की 🥺 ख्वाहिशें 🎶 सबको भूला देती हैं।""",
    """यादें 💭 चिपकी 🌸 हैं मेरे दिल ❤️ से,
जैसे चांद 🌙 सितारों के संग सोए।
यादों 💭 की डाली से कभी ना हटा,
जब तक जिएंगे, तुम्हें 💔 याद तो आता हैं।""",
    """अक्सर यादों 💭 की बरसात 🌧️ होती हैं,
दिल 💔 को चीरती हैं उनकी यादें 💭।
प्यारी सी चिठी ✉️ की खुशबू से महके,
यादों 💭 की जगह बनी रहती हैं वह चित्र 📸।"""
  ];
  static List othershayari = [
    """ज़िन्दगी की 🔥 रेस में हम हैं पहले 😎,
अट्टीट्यूड 👑 हैं हमारा बेवफाई 💔 के साथ।
हम 💯 आदमी 💪 की तरह खड़े होंगे,
चाहे कोई आगे जा रहा हो या पीछे 🌟।""",
    """हमारा दिल ❤️ हैं स्वर्ण 🌟 की तरह,
चमकता रहेगा हमेशा उन्नति के साथ।
हम खुद को 🗡️ तलवार की तरह रखेंगे,
कोई भी हमारे सामरिक स्थल में नहीं आएगा 💪।""",
    """जो 💔 ख़रीदेंगे हमारे दिल ❤️ को,
वो लोग होंगे बेवफा और झूलते रहेंगे।
हम 👑 नहीं छोड़ेंगे अपना राज 👑,
हमारी दौलत की कद्र नहीं करेंगे वो लोग 😎।""",
    """हमारा एटीट्यूड 💯 चमकेगा हमेशा,
अपने मकसदों की ओर हम बढ़ेंगे।
ज़िन्दगी की रेस में हम हैं पहले 😎,
और कोई भी हमारे साथ नहीं टिक पाएगा 💪।
""",
    """यात्रा की इच्छा ✈️ उड़ान भर देती हैं,
नई जगहों की खोज 🌍 मन को बहला देती हैं।
पैरों 🚶‍♂️ की धूल से मिलती हैं ज़मीन की महक 🌄,
खुशबू से भर जाती हैं हमारी आत्मा की आपूर्ति।""",
    """दूरदर्शी हैं हम, सूर्य की प्रकाश सी,
वन 🌺 की शांति से जीने की हमें आदत हो गई।
समुद्र 🌊 की लहरों के संग नाचती हैं हमारी रूह,
स्वतंत्रता के आसमान में उड़ती हैं हमारी ख्वाहिश।""",
    """धूप ☀️ के साथ हम घर से निकलते हैं,
मौसम के रंगों में अपनी आदतें बदलते हैं।
यात्रा के सूरज के नीचे हम जीने का मज़ा लेते हैं,
देखते हैं चमकते हैं सितारों को हमारी नज़रों में।""",
    """यात्रा 🌍 हैं जीने का नया तरीका,
परिंदों की तरह आसमानों में उड़ने का।
हवाओं में स्वतंत्रता का एहसास ✈️,
रेलों की गति 🚂 से दौड़ते जाने का।"""
  ];
  static List rajnitishayari = [
    """राजनीति 🏛️ हैं जनता की आवाज़,
देश 🌍 की सुरक्षा का जवाब हैं वह।
आग 🔥 की तरह जलती हैं उसकी राष्ट्रीयता,
समझौते के लिए नहीं, संघर्ष के लिए तैयार हैं वह।""",
    """सामरिकता 🤝 से बढ़ाती हैं देश की शक्ति,
समानता के लिए लड़ने का संकल्प हैं वह।
धन 💰 का दमन 🚫 करती हैं वह देश के लिए,
जनता के हित के लिए हर संकट सहती हैं वह।""",
    """रहस्यमयता 🤫 में लिपटी हैं उसकी रचनात्मकता,
राजनीति के पर्दे के पीछे छुपती हैं वह।
शांति के लिए खिलती हैं उसकी नीतियों में,
प्यार के फूल 🌹 सबको बाँटती हैं वह।""",
    """राजनीति 🏛️ हैं देश की मजबूती,
सत्ता की 🔥 आग जलती हैं जिसमें सबकी नज़र।
सितारों की तरह 🌟 चमकते हैं राजनेता,
मजबूत हृदय 💔 रखकर देश के लिए काम करता हैं।""",
    """राजनीति का मंत्रालय 💼 हैं शक्ति का घर,
सियासी खेलों में होता हैं दिल ❤️ का यारी का खेल।
संघर्षों से नहीं घबराते हैं राजनेता,
मिलजुलकर 🤝 लोगों को आगे बढ़ाते हैं।""",
    """राष्ट्र की सेवा 🌍 में समर्पित होती हैं वे,
बदलते समयों की रफ्तार में स्थिरता का संकेत होती हैं।
मुस्कान 😏 से कठिनाइयों का सामना करते हैं वे,
बुद्धिमान नेतृत्व से राजनीति को चलाते हैं।""",
    """राजनीति 🎩 यह खेल हैं मचियारों का,
व्यापारी की तरह 💼 खेला जाता हैं यह सबका।
दिल 💔 के साथ जनता की आस्था का,
खेल रहा हैं यह विश्व 🌍 का तांडव नृत्य।""",
    """सत्ता की आग 🔥 जब जलती हैं,
मोर्चे के पीछे अधर्म 😏 छलकता हैं।
सार्थकता 💪 की जगह घमंड पाता हैं,
राजनीति 🎩 का चेहरा हमेशा दिखाता हैं।"""
  ];
  static List premshayari = [
    """जबसे तेरी प्यारी हँसी ने मेरे दिल को छुआ,❤️
मेरे लबों पर खुशियों की फुहार छा जाई।💫
तेरे साथ बिताए हर पल ने दिल को भर दिया,💞
हर दर्द को तूने हराकर खुशियों से भर दिया।🌈""",
    """प्यार 💕 की गहराई में खो जाऊं,
तेरी मुस्कान 😍 में खुद को पाऊं।
तेरे प्यार का चाँद 🌙 जब उभरता हैं,
हर रात को अद्भुत चमक ✨ दिखाता हैं।""",
    """तेरी आँखों 🌸 की मधुरता में बह जाऊं,
तेरे दिल 💞 की धड़कनों में बस जाऊं।
तेरे होंठों की मिठास में गुलाब 🌹 बन जाऊं,
हर सांस में तेरी ख़ुशबू को महकाऊं।""",
    """तेरे साथ हर पल 😍 में खुशी मिलती हैं,
मोहब्बत की रातों में सपने सजती हैं।
तेरे हर झपकी में चाहत का उद्गार होता हैं,
प्यार की गहराई में हमेशा तू बसा होता हैं।""",
    """तेरा प्यार एक चमकती तारा हैं,
जो रौशनी के साथ हमेशा चमकता हैं।
मेरे दिल 💕 की हर धड़कन तुझसे कहती हैं,
तेरे बिना जीना मेरे लिए असंभव होता हैं। 🤗""",
    """प्रेम 🌹 हैं जो दिल ❤️ के अंदर बसता हैं,
दो आत्माओं 💑 को एकता में बांधता हैं।
जैसे चांद 🌙 के साथ तारे ✨ खिलते हैं,
प्रेम 💖 की मिठास से दिल को भरते हैं।""",
    """तुम्हारे साथ ज़िंदगी 🌸 सुहानी हो जाती हैं,
हर पल 😍 ख़ुशियों से भरी हो जाती हैं।
तेरी हंसी के साथ रातें 🌙 चमक उठती हैं,
प्रेम ❤️ की आग से दिल को जलती हैं।""",
    """तेरे प्यार में ✨ दिल का रंग बदल जाता हैं,
हर दिन 💑 नए एहसासों से मिल जाता हैं।
तेरी गोदी में आराम करके रातें बिताता हूँ,
प्रेम 🌹 की गहराइयों में खोकर जीता हूँ।"""
  ];
  static List dardshayari = [
    """दर्द 💔 हैं जो दिल ❤️ के अंदर छिपा हैं,
बादलों की तरह ⚡ आँधी सा घुस जाता हैं।
काली 🌑 रातों में छाया बनकर रहता हैं,
आंखों की आग 🌪️ से दिल को जलता हैं।""",
    """जैसे बादलों के साथ चमकती हैं बिजली ⚡,
दर्द 💔 की चोट से दिल आहत हो जाता हैं।
जहां तू नहीं होती, वहां अकेलापन 🌑 बसता हैं,
दर्द 💔 की आंधी में मन का घुटना चलता हैं।""",
    """दर्द 💔 के बादलों में बसता हैं अल्हड़ता,
प्रकृति की तरह 💫 दिल को उजागर करता हैं।
प्यार के फूल 🌹 की जगह खुदाई 🌼 होती हैं,
दर्द 💔 के फूलों में भी खुशबू समाता हैं।""",
    """दर्द 💔 हैं जो इंसान की एक पहचान हैं,
वहां जहां आंखों की आंसू 😢 बहते हैं।
दर्द 💔 के बाद आता हैं राहत का वक्त,
हर दर्द 💔 के पीछे एक सबक छिपा होता हैं।""",
    """दर्द 💔 की बूँदें बरसती हैं मेरे दिल ❤️ पर,
जैसे बादलों की रिमझिम 🌧️ सजा देती हैं।
फूलों 🌹 की मुस्कान छिन लेती हैं गम को,
जब चांद 🌙 को छू जाती हैं आँधी 🌪️ गुज़रती हैं।""",
    """दर्द 💔 की आँधी 🌪️ लहराती हैं दिल को,
जैसे काली 🖤 रातों में अँधेरा छाती हैं।
अलग हैं अब रंग ज़िंदगी के,
दर्द 💔 ने हर चीज़ को उजाला छीन लिया हैं।""",
    """हर पल 😔 जीने का दर्द 💔 सहते हैं,
जैसे चिराग़ की ज्योति बुझ जाती हैं।
दर्द 💔 से लिपटी हुई हैं रातें 🌃,
जब तक आँखें न बंद हों, नींद नहीं आती हैं।""",
    """दर्द 💔 बना हुआ हैं मेरी कहानी का हिस्सा,
जैसे उजालों के बिना रह गई हैं दुनिया।
कहाँ से आएंगे चिराग़ ख़ुशियों के,
दर्द 💔 के बादलों को हमेशा बरसाती हैं।"""
  ];
  static List grediantcolor = [
    Colors.black,
    Colors.blue,
    Colors.indigo,
    Colors.red,
    Colors.pinkAccent,
    Colors.purple,
    Colors.orange,
    Colors.deepPurple,
    Colors.brown,
    Colors.lightBlueAccent,
    Colors.lime,
    Colors.cyanAccent,
    Colors.tealAccent,
    Colors.blue.shade900,
    Colors.yellowAccent,
  ];
  static List Emoji = [
    "😀 😃 😄 😁 😆 😅 😂 🤣",
    "🤩 🥳 ☺️ 😊 😇 🙂 🙃 😉",
    "😌 😍 🥰 😘 😗 😙 😚 😋",
    "🍃 🍂 🍁 🍄 🐚 🪨 🌾 💐",
    "🌷 🪷 🌹 🥀 🌺 🌸 🌼 🌻",
    "❣️ 💕 💞 💓 💗 💖 💘 💝"
  ];
  static List Font = [
    "Font 1",
    "Font 2",
    "Font 3",
    "Font 4",
    "Font 5",
    "Font 6",
    "Font 7",
    "Font 8",
    "Font 9",
    "Font 10"
  ];
}
